# tap 'homebrew/cask'
# tap 'homebrew/cask-versions'
# tap 'homebrew/cask-fonts' # Fonts
# tap 'homebrew/cask-drivers' # For logitech-options
tap 'oven-sh/bun'
tap 'abhimanyu003/sttr'

brew 'mas' # Mac App Store manager
brew 'stow'
brew 'ssh-copy-id'
brew 'htop'
brew 'btop'
brew 'ctop'
brew 'tree'
brew 'openssl'
brew 'wget'
brew 'optipng'
brew 'ctags'
brew 'ccrypt'
brew 'fnm' # 🚀 Fast and simple Node.js version manager, built in Rust
brew 'bun' # Incredibly fast JavaScript runtime, bundler, test runner, and package manager – all in one
brew 'prettierd'
brew 'firebase-cli'
brew 'watchman'
brew 'svn' # Needed for some brew formulas

# Git tools
brew 'git-lfs'
brew 'tig'
brew 'jesseduffield/lazygit/lazygit' # simple terminal UI for git commands
brew 'git-delta' # A syntax-highlighting pager for git, diff, and grep output

brew 'mise'
brew 'rbenv'
brew 'ruby-build'
brew 'rubyfmt'

brew 'overmind' # Overmind is a process manager for Procfile-based applications and tmux.
brew 'wrk'
brew 'tmux'
brew 'tmuxinator'
brew 'zellij'
brew 'zsh'
brew 'starship'

# Comand Line Tools
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'zoxide' # zoxide is a blazing fast replacement for your cd command, inspired by z and z.lua.
brew 'fzf' # 🌸 A command-line fuzzy finder
brew 'chafa' # Versatile and fast Unicode/ASCII/ANSI graphics renderer

# Ruby dependencies
brew 'shared-mime-info' # For mimemagic gem

# Editors
brew 'vim'
brew 'neovim'
brew 'neovide'
brew 'helix'

# File managers
brew 'mc'
brew 'vifm'
brew 'ranger'

# Static site generators
brew 'hugo'

brew 'go'
brew 'rust'
# brew 'elixir'
brew 'luarocks' # LuaRocks is the package manager for the Lua programming language.
brew 'docker'
brew 'docker-compose'
# brew 'container' # A tool for creating and running Linux containers using lightweight virtual machines on a Mac. It is written in Swift, and optimized for Apple silicon.
brew 'colima' # Container runtimes on macOS (and Linux) with minimal setup
# brew 'docker-machine'

# Searching tools
brew 'ripgrep' # ripgrep recursively searches directories for a regex pattern
brew 'fd' # fd is a simple, fast and user-friendly alternative to find.

brew 'bat' # bat supports syntax highlighting for a large number of programming and markup languages
brew 'tldr'
brew 'tokei'   # Count your code, quickly.
brew 'eza'     # A modern alternative to ls
brew 'sttr'    # Cross-platform, cli app to perform various operations on string
brew 'gnu-sed' # GNU "sed" has been installed as "gsed".
brew 'dust'    # A more intuitive version of du in rust
brew 'duf'     # Disk Usage/Free Utility - a better 'df' alternative

# For Nokogiri gem
brew 'libxml2'
brew 'libxslt'
# Dependendices for rmagick, minimagick, image_processing gems
brew 'imagemagick@6'
#brew 'imagemagick'
brew 'graphicsmagick'
brew 'vips' # A fast image processing library with low memory needs.

# For erd and railroady gem
brew 'graphviz'

# For update 'time' command
brew 'coreutils'

brew 'redis', restart_service: false
brew 'memcached', restart_service: false

#
# Databases
#
brew 'postgresql@16'
brew 'mysql@5.7', restart_service: false
brew 'opensearch'

brew 'opencode' # AI coding agent, built for the terminal

#
# Database clients
#
brew 'pgcli' # This is a postgres client that does auto-completion and syntax highlighting.
brew 'pspg' # Unix pager (with very rich functionality) designed for work with tables.

# Video and audio converters
brew 'ffmpeg'
brew 'ffmpegthumbnailer'

brew 'tailscale'
brew 'ansible'

#
# Install Casks
#
#cask 'cyberduck'
cask '1password'
cask 'dbngin'
cask 'evernote'

cask 'alfred'
cask 'java@beta'

################################################
# Terminal emulators
################################################

cask 'iterm2'
cask 'alacritty'
cask 'kitty'
cask 'wezterm' # GPU-accelerated cross-platform terminal emulator and multiplexer
cask 'ghostty' # 👻 Ghostty is a fast, feature-rich, and cross-platform terminal emulator that uses platform-native UI and GPU acceleration.
#cask 'hyper'
#cask 'warp' # Rust-based terminal

#cask 'sequel-pro'
# Redis desktop manager
#cask 'rdm'
cask 'postman'
cask 'keycastr'
cask 'ngrok'

cask 'google-drive'
cask 'gcloud-cli'

cask 'dropbox'

# Development
# cask 'fastlane'
cask 'virtualbox@beta' # Beta version supports Arm processors
cask 'vagrant'
# cask 'chefdk'
# cask 'android-studio'
# cask 'android-sdk'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'zed'
cask 'cursor'
# cask 'alcatraz'
# cask 'gitter'
# cask 'grammarly'

# cask 'omnidisksweeper'
cask 'imageoptim'
cask 'daisydisk'

# Web browsers
cask 'google-chrome'
# cask 'brave-browser'
cask 'firefox'
cask 'tor-browser'
cask 'min'

cask 'vlc'
# cask 'android-file-transfer'
cask 'steam'
# cask 'unrarx'
cask 'the-unarchiver'
# cask 'sourcetree'
# cask 'sketch'
# cask 'sketch-toolbox'
cask 'figma'
# cask 'bittorrent'
cask 'telegram'
# cask 'launchrocket'
cask 'slack'
cask 'zoom'
# cask 'skype'
cask 'viber'
# cask 'gifrocket'
# cask 'studio-3t'
# cask 'discord'
# cask 'tower'

cask 'amethyst' # Tiling window manager for macOS
cask 'raycast'

# Logitech Options - Drivers for MX Master 3
cask 'logitech-options'
cask 'ticktick' # To-do & task list manager

# AI
cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'codex' # OpenAI's coding agent that runs in your terminal
cask 'ollama-app'

# Dictionaries extends your Mac, by adding bidirectional translation, spellchecking and pronunciation for over 80 languages.
# https://dictionaries.io/
cask 'dictionaries'

# cask 'obs' # Open-source software for live streaming and screen recording

# Fonts
cask 'font-camingocode'
cask 'font-lato'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-monoid'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-for-powerline'
cask 'font-fantasque-sans-mono'
cask 'font-recursive-code'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-0xproto-nerd-font'
