tap 'homebrew/cask'
tap 'homebrew/cask-versions'

brew 'mas' # Mac App Store manager
#brew 'yarn'
brew 'stow'
brew 'ssh-copy-id'
brew 'htop'
brew 'openssl'
brew 'wget'
brew 'optipng'
brew 'ctags'
brew 'ccrypt'
#brew 'node'
#brew 'node@10'
brew 'nvm' # Node version manager
brew 'watchman'
brew 'git-lfs'
brew 'tig'
# simple terminal UI for git commands
brew 'jesseduffield/lazygit/lazygit'
brew 'rbenv'
brew 'ruby-build'
brew 'wrk'
brew 'ctop'
brew 'zsh'
brew 'vim'
brew 'neovim'
brew 'tmux'
brew 'tmuxinator'
brew 'z' # Tracks most-used directories to make cd smarter

# File managers
brew 'mc'
brew 'vifm'
brew 'ranger'

brew 'tree'
brew 'go'
brew 'elixir'
brew 'docker'
# brew 'docker-compose'
# brew 'docker-machine'

# Searching tools
brew 'ack'
brew 'the_silver_searcher'
# ripgrep recursively searches directories for a regex pattern
brew 'ripgrep'
# fd is a simple, fast and user-friendly alternative to find. 
brew 'fd'

# bat supports syntax highlighting for a large number of programming and markup languages
brew 'bat'
brew 'tldr'

# For Nokogiri gem
brew 'libxml2'
brew 'libxslt'

# For erd and railroady gem
brew 'graphviz'

# For update 'time' command
brew 'coreutils'

brew 'redis', restart_service: false 
brew 'memcached', restart_service: false 
brew 'imagemagick@6'
#brew 'imagemagick'
brew 'graphicsmagick'

#brew 'postgresql'
#brew 'postgresql@10'
brew 'postgresql@12'
brew 'mysql@5.7', restart_service: false
#brew 'mongodb', restart_service: false
brew 'elasticsearch', restart_service: false

# Video and audio converters
brew 'ffmpeg'
brew 'ffmpegthumbnailer'
brew 'libav'
#brew 'phpmyadmin'
#cask 'java8'
#cask 'adoptopenjdk8'
#brew 'jenkins'

#
# Install Casks
#
#cask 'cyberduck'
cask '1password'
cask 'dbngin'
cask 'cloudapp'
cask 'evernote'

cask 'alfred'
cask 'java'

# Terminal emulators
cask 'iterm2'
cask 'alacritty'
cask 'kitty'

#cask 'upterm'
#cask 'robomongo'
cask 'pgadmin4'
#cask 'sequel-pro'
# Redis desktop manager
#cask 'rdm'
cask 'postman'
cask 'keycastr'
cask 'ngrok'

cask 'google-backup-and-sync'
cask 'google-cloud-sdk'

# Development
#cask 'fastlane'
#cask 'virtualbox'
cask 'vagrant'
#cask 'chefdk'
#cask 'hyper'
#cask 'android-studio'
#cask 'android-sdk'
cask 'visual-studio-code'
cask 'sublime-text'
#cask 'atom'
#cask 'rubymine'
#cask 'alcatraz'
cask 'gitter'
#cask 'grammarly'
# To play AceStreams
cask 'soda-player'
# I think kodi can play some NFL streams. Not use it anymore
#cask 'kodi'

#cask 'omnidisksweeper'
cask 'imageoptim'
cask 'daisydisk'

# Web browsers
cask 'google-chrome'
cask 'brave-browser'
cask 'firefox'
cask 'tor-browser'

cask 'vlc'
#cask 'android-file-transfer'
#cask 'steam'
#cask 'unrarx'
cask 'the-unarchiver'
#cask 'sourcetree'
#cask 'sketch'
#cask 'sketch-toolbox'
#cask 'figma'
#cask 'bittorrent'
cask 'telegram'
#cask 'launchrocket'
cask 'slack'
# cask 'skype'
cask 'viber'
#cask 'gifrocket'
#cask 'radiant-player'
#cask 'flash-npapi' # As dependency for Radiant Player
#cask 'studio-3t'
#cask 'discord'
#cask 'tower'
cask 'amethyst' # Tiling window manager for macOS
