tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts' # Fonts
tap 'homebrew/cask-drivers' # For logitech-options
tap 'mongodb/brew'
tap 'elastic/tap'

brew 'mas' # Mac App Store manager
brew 'stow'
brew 'ssh-copy-id'
brew 'htop'
brew 'tree'
brew 'openssl'
brew 'wget'
brew 'optipng'
brew 'ctags'
brew 'ccrypt'
brew 'fnm' # 🚀 Fast and simple Node.js version manager, built in Rust
brew 'firebase-cli'
brew 'watchman'
brew 'git-lfs'
brew 'svn' # Needed for some brew formulas
brew 'tig'
# simple terminal UI for git commands
brew 'jesseduffield/lazygit/lazygit'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv'
brew 'overmind' # Overmind is a process manager for Procfile-based applications and tmux.
brew 'wrk'
brew 'ctop'
brew 'tmux'
brew 'tmuxinator'
brew 'zellij'
brew 'zsh'
brew 'starship'
brew 'zoxide' # zoxide is a blazing fast replacement for your cd command, inspired by z and z.lua.
brew 'fzf' # 🌸 A command-line fuzzy finder

# Ruby dependencies
brew 'shared-mime-info' # For mimemagic gem

# Editors
brew 'vim'
brew 'neovim'
brew 'helix'

# File managers
brew 'mc'
brew 'vifm'
brew 'ranger'

# Static site generators
brew 'hugo'

brew 'go'
brew 'rust'
brew 'elixir'
brew 'luarocks' # LuaRocks is the package manager for the Lua programming language.
brew 'docker'
# brew 'docker-compose'
# brew 'docker-machine'

# Searching tools
brew 'the_silver_searcher'
brew 'ripgrep' # ripgrep recursively searches directories for a regex pattern
brew 'fd' # fd is a simple, fast and user-friendly alternative to find.

# bat supports syntax highlighting for a large number of programming and markup languages
brew 'bat'
brew 'tldr'
brew 'exa' # a modern replacement for ls.

# For Nokogiri gem
brew 'libxml2'
brew 'libxslt'

# For erd and railroady gem
brew 'graphviz'

# For update 'time' command
brew 'coreutils'

brew 'redis', restart_service: false
brew 'memcached', restart_service: false
brew 'imagemagick@6'
#brew 'imagemagick'
brew 'graphicsmagick'
brew 'vips' # A fast image processing library with low memory needs.

#
# Databases
#
#brew 'postgresql'
brew 'postgresql@12'
brew 'mysql@5.7', restart_service: false
#brew 'elasticsearch', restart_service: false
brew 'elastic/tap/elasticsearch-full'
# Install mongodb from tap mongodb/brew
brew 'mongodb-community@5.0'

#
# Database clients
#
brew 'pgcli' # This is a postgres client that does auto-completion and syntax highlighting.

# Video and audio converters
brew 'ffmpeg'
brew 'ffmpegthumbnailer'
brew 'libav'

#cask 'java8'
#cask 'adoptopenjdk8'

brew 'tailscale'
brew 'ansible'

#
# Install Casks
#
#cask 'cyberduck'
cask '1password'
cask 'dbngin'
cask 'cloudapp'
cask 'evernote'

cask 'alfred'
cask 'java'

# Terminal emulators
cask 'iterm2'
cask 'alacritty'
cask 'kitty'
cask 'wezterm' # GPU-accelerated cross-platform terminal emulator and multiplexer
#cask 'hyper'
#cask 'warp' # Rust-based terminal

#cask 'sequel-pro'
# Redis desktop manager
#cask 'rdm'
cask 'postman'
cask 'keycastr'
cask 'ngrok'

cask 'google-drive'
cask 'google-cloud-sdk'

cask 'dropbox'

# Development
# cask 'fastlane'
cask 'virtualbox'
cask 'vagrant'
# cask 'chefdk'
# cask 'android-studio'
# cask 'android-sdk'
cask 'visual-studio-code'
cask 'sublime-text'
# cask 'alcatraz'
# cask 'gitter'
# cask 'grammarly'

# To play AceStreams
cask 'soda-player'
# I think kodi can play some NFL streams. Not use it anymore
# cask 'kodi'

# cask 'omnidisksweeper'
cask 'imageoptim'
cask 'daisydisk'

# Web browsers
cask 'google-chrome'
# cask 'brave-browser'
cask 'firefox'
cask 'tor-browser'
cask 'min'

cask 'vlc'
# cask 'android-file-transfer'
cask 'steam'
# cask 'unrarx'
cask 'the-unarchiver'
# cask 'sourcetree'
# cask 'sketch'
# cask 'sketch-toolbox'
# cask 'figma'
# cask 'bittorrent'
cask 'telegram'
# cask 'launchrocket'
cask 'slack'
# cask 'skype'
cask 'viber'
# cask 'gifrocket'
# cask 'studio-3t'
# cask 'discord'
# cask 'tower'

cask 'amethyst' # Tiling window manager for macOS

# Logitech Options - Drivers for MX Master 3
cask 'logitech-options'
cask 'ticktick' # To-do & task list manager

# Dictionaries extends your Mac, by adding bidirectional translation, spellchecking and pronunciation for over 80 languages.
# https://dictionaries.io/
cask 'dictionaries'

# Fonts
cask 'font-camingocode'
cask 'font-lato'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-monoid'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-for-powerline'
cask 'font-fantasque-sans-mono'
